atmosphere/tutorials/ce3/bubble_15_625m/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     strakaFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1020;

deltaT          0.1;

writeControl    timeStep;

writeInterval   100; //4080;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.1;

libs ( "libOpenFOAM.so" "libgroovyBC.so" ) ;






// ************************************************************************* //
